"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""


a = 4
b = 7
c = "Hi!"
print(a)
print(b)
print(c)
d = input('Введите первое число:')
e = input('Введите второе число:')
str_1 = input('Введите первую фразу:')
str_2 = input('Введите вторую фразу:')
print('Вы ввели число: ' + d + ' первым. Вы ввели фразу: "' + str_1 + '" первой.')
print('Вы ввели число: ' + e + ' вторым. Вы ввели фразу: "' + str_2 + '" второй.')
